2024-01-22-TryOrgStaticBlog/notes.org
#+TITLE: Org Static Blog: A Simple Static Site Generator
#+AUTHOR: Dou Meishi
#+DATE: [2024-01-22]
#+FILETAGS: emacs

I picked up most of my computer skills from reading posts online, and
it got me thinking about having my own blog where I can share what
I've learned. But I've always been a bit hesitant about learning all
the complicated stuff in web development.  Recently, I came across a
third-party emacs package called =org-static-blog= while searching for
the built-in functionality =org-publish=.  After browsing a few blog
sites created with this package, I was impressed by its simplicity and
the ability to blog using org files. It became clear that this package
is exactly what I need at this stage.

After a few minites of survey, I observed the following facts.

1. The source code is simple enough. There is only a single elisp
   script with less than 1000 lines.  The code is well-organized, with
   customization variables appearing first, followed by commands. It
   doesn't involve any complex or cryptic syntax.

2. The developer maintains this project over 8 years and he continues to use it in his blog site.

3. There are a few appealing blog sites are created by org static blog,
   e.g.,  [[https://bastibe.de/about.html][Bastian]],  [[https://jao.io/blog/about.html][Jose Antonio Ortega Ruiz]],  [[https://justin.abrah.ms/][Justin Abrahms]], [[http://alhassy.com/about][Musa Al-hassy]]...

Finally, I decide to give it a try. I hope it can give me a way to
share my thoughts on the internet.

** Go through the manual

The [[https://github.com/bastibe/org-static-blog/blob/master/README.org][README]] contains a brief introduction to the usage and a minimal working example.

First, let us review the introduction.

#+BEGIN_QUOTE
Static blog generators are a dime a dozen. This is one more, which focuses on being simple. All files are simple org-mode files in a directory. The only requirement is that every org file must have a =#+TITLE= and a =#+DATE=, and optionally, =#+FILETAGS=, =#+DESCRIPTION= and =#+IMAGE=.
#+END_QUOTE

After collecting the appropriate org files, publishing them by org
static blog needs only two steps: 1) customizing org static blog
parameters; 2) calling =org-static-blog-publish= to publish all posts,
or calling =org-static-blog-publish-filename= to publish only a
particular post.

The blog site generated by org static blog consists of six parts.

1. /Posts./ Every org file in =org-static-blog-posts-directory= is one blog post.
   Each blog post is rendered as its own HTML page.

2. /Index./ The index page contains the last few blog posts on a single page.
   The number of entries on  the index page can be customized
   using =org-static-blog-index-length=.

3. /Tags./ Each blog post can be tagged, and each tag links to a page
   that lists all other posts of the same tag. This feature is only
   enabled when =org-static-blog-enable-tags= is =t=.

4. /Archives./ This page lists the publishing dates and headlines of every blog post.

5. /RSS Feeds./ This is a machine-readable XML file that contains every blog
   post. It is not meant to be consumed by humans. Instead RSS readers
   can use the RSS feed to aggregate entries from multiple blogs.

6. /Drafts./ They are rendered like regular blog posts, but are not included
   in the index, the archive, or the RSS feed.

Every HTML page in org static blog can be customized in the following aspects.

1. =org-static-blog-page-header=. This is inserted into the =<head>= of every page.
   Use this to include custom CSS and JavaScript for your blog.

2. =org-static-blog-page-preamble=. This is inserted just before the
   content of every page. This is a good place to put the header or
   menus for your blog.

3. =org-static-blog-page-postamble=. This is inserted after the content
   of every generated page: after any blog post page, after the index
   page, the tag pages and the archive. This is where you can include
   copyright notices.

4. =org-static-blog-post-preamble= and
   =org-static-blog-post-postamble=. The returned values are prepended
   and appended to every blog post. If you want to change the
   formatting of dates, titles, or the tag list, overwrite these
   functions. In particular the content of
   =org-static-blog-post-comments= is inserted at the end of each blog
   post. Use this to add a comment box.

Other features:

1. Optionally show a preview of the post (instead of the full post) on
   the index page setting =org-static-blog-use-preview= to =t=. The region
   of the post used as a preview is, by default, its first paragraph,
   but can be fine-tuned using =org-static-blog-preview-start= and
   =org-static-blog-preview-end=.

2. Activate a few convenience key bindings by

   #+BEGIN_SRC elisp
(add-to-list 'auto-mode-alist
             (cons (concat
                    org-static-blog-posts-directory ".*\\.org\\'")
                   'org-static-blog-mode))
   #+END_SRC

   These key bindings are:

   1. =C-c C-f= / =C-c C-b= to open next/previous post.
   2. =C-c C-p= to open the matching published HTML file of a post.
   3. =C-c C-n= to create a new blog post.

