2024-01-22-TryOrgStaticBlog/notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://dou-meishi.github.io/org-blog/rss.xml"
      title="RSS feed for https://dou-meishi.github.io/org-blog/">
<title>Org Static Blog: A Simple Static Site Generator</title>
<meta name="author" content="Dou Meishi">
<meta name="referrer" content="no-referrer">
<link href= "https://gongzhitaao.org/orgcss/org.css" rel="stylesheet" type="text/css" />
<link href= "https://dou-meishi.github.io/org-blog/static/dou-org-blog.css" rel="stylesheet" type="text/css" />
<!-- Math Support by KaTeX -->
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/katex.min.css" integrity="sha384-n8MVd4RsNIU0tAv4ct0nTaAbDJwPJzDEaqSD1odI+WdtXRGWt2kTvGFasHpSy3SV" crossorigin="anonymous">
<!-- The loading of KaTeX is deferred to speed up page rendering -->
<!-- To automatically render math in text elements, include the auto-render extension: -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <div class="sitelinks">
    <a href="https://dou-meishi.github.io/org-blog/index.html">Home</a>
    |
    <a href="https://dou-meishi.github.io/org-blog/archive.html">All Posts</a>
  </div>
</div>
</div>
<div id="content">
<div class="post-date">22 Jan 2024</div><h1 class="post-title"><a href="https://dou-meishi.github.io/org-blog/2024-01-22-TryOrgStaticBlog/notes.html">Org Static Blog: A Simple Static Site Generator</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgafbecae">Go through the manual</a></li>
<li><a href="#org78688c1">Minimal Configuration</a></li>
<li><a href="#org4e41046">Question</a></li>
<li><a href="#org0ae630e">Build My Blog Site</a></li>
<li><a href="#org5f867cc">External Links&#xa0;&#xa0;&#xa0;<span class="tag"><span class="refs">refs</span></span></a></li>
</ul>
</div>
</nav>
<p>
I picked up most of my computer skills from reading posts online, and
it got me thinking about having my own blog where I can share what
I've learned. But I've always been a bit hesitant about learning all
the complicated stuff in web development.  Recently, I came across a
third-party emacs package called <code>org-static-blog</code> while searching for
the built-in functionality <code>org-publish</code>.  After browsing a few blog
sites created with this package, I was impressed by its simplicity and
the ability to blog using org files. It became clear that this package
is exactly what I need at this stage.
</p>

<p>
After a few minites of survey, I observed the following facts.
</p>

<ol class="org-ol">
<li>The source code is simple enough. There is only a single elisp
script with less than 1000 lines.  The code is well-organized, with
customization variables appearing first, followed by commands. It
doesn't involve any complex or cryptic syntax.</li>

<li>The developer maintains this project over 8 years and he continues to use it in his blog site.</li>

<li>There are a few appealing blog sites are created by org static blog,
e.g.,  <a href="https://bastibe.de/about.html">Bastian</a>,  <a href="https://jao.io/blog/about.html">Jose Antonio Ortega Ruiz</a>,  <a href="https://justin.abrah.ms/">Justin Abrahms</a>, <a href="http://alhassy.com/about">Musa Al-hassy</a>&#x2026;</li>
</ol>

<p>
Finally, I decide to give it a try. I hope it can give me a way to
share my thoughts on the internet.
</p>

<div id="outline-container-orgafbecae" class="outline-2">
<h2 id="orgafbecae">Go through the manual</h2>
<div class="outline-text-2" id="text-orgafbecae">
<p>
The <a href="https://github.com/bastibe/org-static-blog/blob/master/README.org">README</a> contains a brief introduction to the usage and a minimal working example.
</p>

<p>
First, let us review the introduction.
</p>

<blockquote>
<p>
Static blog generators are a dime a dozen. This is one more, which focuses on being simple. All files are simple org-mode files in a directory. The only requirement is that every org file must have a <code>#+TITLE</code> and a <code>#+DATE</code>, and optionally, <code>#+FILETAGS</code>, <code>#+DESCRIPTION</code> and <code>#+IMAGE</code>.
</p>
</blockquote>

<p>
After collecting the appropriate org files, publishing them by org
static blog needs only two steps: 1) customizing org static blog
parameters; 2) calling <code>org-static-blog-publish</code> to publish all posts,
or calling <code>org-static-blog-publish-filename</code> to publish only a
particular post.
</p>

<p>
The blog site generated by org static blog consists of six parts.
</p>

<ol class="org-ol">
<li><i>Posts.</i> Every org file in <code>org-static-blog-posts-directory</code> is one blog post.
Each blog post is rendered as its own HTML page.</li>

<li><i>Index.</i> The index page contains the last few blog posts on a single page.
The number of entries on  the index page can be customized
using <code>org-static-blog-index-length</code>.</li>

<li><i>Tags.</i> Each blog post can be tagged, and each tag links to a page
that lists all other posts of the same tag. This feature is only
enabled when <code>org-static-blog-enable-tags</code> is <code>t</code>.</li>

<li><i>Archives.</i> This page lists the publishing dates and headlines of every blog post.</li>

<li><i>RSS Feeds.</i> This is a machine-readable XML file that contains every blog
post. It is not meant to be consumed by humans. Instead RSS readers
can use the RSS feed to aggregate entries from multiple blogs.</li>

<li><i>Drafts.</i> They are rendered like regular blog posts, but are not included
in the index, the archive, or the RSS feed.</li>
</ol>

<p>
Every HTML page in org static blog can be customized in the following aspects.
</p>

<ol class="org-ol">
<li><code>org-static-blog-page-header</code>. This is inserted into the <code>&lt;head&gt;</code> of every page.
Use this to include custom CSS and JavaScript for your blog.</li>

<li><code>org-static-blog-page-preamble</code>. This is inserted just before the
content of every page. This is a good place to put the header or
menus for your blog.</li>

<li><code>org-static-blog-page-postamble</code>. This is inserted after the content
of every generated page: after any blog post page, after the index
page, the tag pages and the archive. This is where you can include
copyright notices.</li>

<li><code>org-static-blog-post-preamble</code> and
<code>org-static-blog-post-postamble</code>. The returned values are prepended
and appended to every blog post. If you want to change the
formatting of dates, titles, or the tag list, overwrite these
functions. In particular the content of
<code>org-static-blog-post-comments</code> is inserted at the end of each blog
post. Use this to add a comment box.</li>
</ol>

<p>
Other features:
</p>

<ol class="org-ol">
<li>Optionally show a preview of the post (instead of the full post) on
the index page setting <code>org-static-blog-use-preview</code> to <code>t</code>. The region
of the post used as a preview is, by default, its first paragraph,
but can be fine-tuned using <code>org-static-blog-preview-start</code> and
<code>org-static-blog-preview-end</code>.</li>

<li><p>
Activate a few convenience key bindings by
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'auto-mode-alist
             (cons (concat
                    org-static-blog-posts-directory <span style="color: #2aa198;">".*\\.org\\'"</span>)
                   'org-static-blog-mode))
</pre>
</div>

<p>
These key bindings are:
</p>

<ol class="org-ol">
<li><code>C-c C-f</code> / <code>C-c C-b</code> to open next/previous post.</li>
<li><code>C-c C-p</code> to open the matching published HTML file of a post.</li>
<li><code>C-c C-n</code> to create a new blog post.</li>
</ol></li>
</ol>
</div>
</div>
