2024-01-22-TryOrgStaticBlog/notes.org
** Minimal Configuration

Following the example in its manual, I try to build a blog site at
=./org-blog/= with a folder =./org-blog/org/= containing several org
files.

The first step is, of course, installing the package.

#+BEGIN_SRC elisp
(package-install 'org-static-blog)
#+END_SRC

The next step is setting up variables. I want to do the following things.

1. Set the site title to /Hello, Org Static Blog/
2. Set the url of the site to =file:///home/dou/Documents/2024-01-22-TryOrgStaticBlog/org-blog/=
3. Set the directory that holds all html files to =./org-blog/=
4. Set the directory that holds all org files to be published to  =./org-blog/org/=
5. Set the directory that holds all drafts to  =./org-blog/drafts/=
6. Set the page header as the content of the file =./org-blog/static/header.html=
7. Set the page preamble as the content of the file =./org-blog/static/preamble.html=
8. Set the page postamble as the content of the file =./org-blog/static/postamble.html=
9. Enable tags
10. Enable preview

#+BEGIN_SRC elisp
(require 'org-static-blog)

(setq dms/org-static-blog-root-dir "/home/dou/Documents/2024-01-22-TryOrgStaticBlog/org-blog/")

(setq org-static-blog-publish-title "Hello, Org Static Blog")
(setq org-static-blog-publish-url (format "file://%s" dms/org-static-blog-root-dir))
(setq org-static-blog-publish-directory (format "%s" dms/org-static-blog-root-dir))
(setq org-static-blog-posts-directory (format "%sorg" dms/org-static-blog-root-dir))
(setq org-static-blog-drafts-directory (format "%sdrafts" dms/org-static-blog-root-dir))
(setq org-static-blog-page-header (with-temp-buffer
  (insert-file-contents (format "%sstatic/header.html" dms/org-static-blog-root-dir))
  (buffer-string)))
(setq org-static-blog-page-preamble (with-temp-buffer
  (insert-file-contents (format "%sstatic/preamble.html" dms/org-static-blog-root-dir))
  (buffer-string)))
(setq org-static-blog-page-postamble (with-temp-buffer
  (insert-file-contents (format "%sstatic/postamble.html" dms/org-static-blog-root-dir))
  (buffer-string)))
(setq org-static-blog-enable-tags t)
(setq org-static-blog-use-preview t)
#+END_SRC

Contents of =header.html=, =preamble.html= and =postamble.html= are given as follows.
Assets =static/style.css= and =static/favicon.ico= are downloaded from [[https://github.com/bastibe/bastibe.github.com/tree/master/static][Bastian]].

#+BEGIN_SRC html :tangle ./org-blog/static/header.html
<meta name="author" content="Dou Meishi">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link href="static/favicon.ico" rel="icon" />
#+END_SRC

#+BEGIN_SRC html :tangle ./org-blog/static/preamble.html
<div class="header">
  Hello, Org Static Blog
</div>
#+END_SRC

#+BEGIN_SRC html :tangle ./org-blog/static/postamble.html
Created by <a href="https://github.com/bastibe/org-static-blog/">Org Static Blog</a>
#+END_SRC

Currently, the project layout looks like

#+BEGIN_EXAMPLE
org-blog/
├── drafts
├── org
│   └── notes.org
└── static
    ├── favicon.ico
    ├── header.html
    ├── postamble.html
    ├── preamble.html
    └── style.css

3 directories, 6 files
#+END_EXAMPLE

Finally, call  =org-static-blog-publish= to generate the site. At this time, the project layout becomes

#+BEGIN_EXAMPLE
org-blog/
├── archive.html
├── drafts
├── index.html
├── notes.html
├── org
│   └── notes.org
├── rss.xml
├── static
│   ├── favicon.ico
│   ├── header.html
│   ├── postamble.html
│   ├── preamble.html
│   └── style.css
└── tags.html

3 directories, 11 files
#+END_EXAMPLE

** Question

1. Does it scans all org files in =org-static-blog-posts-directory= recursively or not?

   Yes. For example, a folder named =2024/= in it will be published to the folder =2024/= in
   =org-static-blog-publish-directory=.

2. Does it support following symbolic links when checking org files?

   Yes but no. I test the following based on the project layout in the /Minimal Configuration/ section.
   I renamed the ordinary file =notes.org= inside =org-blog/org/= to =org-blog/../= but leave
   a symbolic link. So the project layout becomes.

   #+BEGIN_EXAMPLE
org-blog/
├── drafts
├── org
│   └── notes.org -> /home/dou/Documents/2024-01-22-TryOrgStaticBlog/notes.org
└── static
    ├── favicon.ico
    ├── header.html
    ├── postamble.html
    ├── preamble.html
    └── style.css

3 directories, 6 files
   #+END_EXAMPLE

   However, calling =org-static-blog-pulish= exports =org-blog/org/notes.org= to =~/Documents/notes.html=.

   This issue comes function =org-static-blog-get-post-public-path=. Running either

   #+BEGIN_SRC elisp
(org-static-blog-get-post-public-path "~/Documents/2024-01-22-TryOrgStaticBlog/notes.org")
   #+END_SRC

   or

   #+BEGIN_SRC elisp
(org-static-blog-get-post-public-path "~/Documents/2024-01-22-TryOrgStaticBlog/org-blog/org/notes.org")
   #+END_SRC

   gives the result =../../notes.html=.

3. What will happen if =org-static-blog-publish-directory= is the same
   as =org-static-blog-posts-directory=?  In this case, what will happen
   if =org-static-blog-drafts-directory= is a subfolder?

   It behaves like exporting all org files to the same directory, and posts inside
   the drafts directory will not be included in the index.

