2024-01-22-TryOrgStaticBlog/notes.html

<div id="outline-container-org78688c1" class="outline-2">
<h2 id="org78688c1">Minimal Configuration</h2>
<div class="outline-text-2" id="text-org78688c1">
<p>
Following the example in its manual, I try to build a blog site at
<code>./org-blog/</code> with a folder <code>./org-blog/org/</code> containing several org
files.
</p>

<p>
The first step is, of course, installing the package.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(package-install 'org-static-blog)
</pre>
</div>

<p>
The next step is setting up variables. I want to do the following things.
</p>

<ol class="org-ol">
<li>Set the site title to <i>Hello, Org Static Blog</i></li>
<li>Set the url of the site to <code>file:///home/dou/Documents/2024-01-22-TryOrgStaticBlog/org-blog/</code></li>
<li>Set the directory that holds all html files to <code>./org-blog/</code></li>
<li>Set the directory that holds all org files to be published to  <code>./org-blog/org/</code></li>
<li>Set the directory that holds all drafts to  <code>./org-blog/drafts/</code></li>
<li>Set the page header as the content of the file <code>./org-blog/static/header.html</code></li>
<li>Set the page preamble as the content of the file <code>./org-blog/static/preamble.html</code></li>
<li>Set the page postamble as the content of the file <code>./org-blog/static/postamble.html</code></li>
<li>Enable tags</li>
<li>Enable preview</li>
</ol>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">org-static-blog</span>)

(<span style="color: #859900; font-weight: bold;">setq</span> dms/org-static-blog-root-dir <span style="color: #2aa198;">"/home/dou/Documents/2024-01-22-TryOrgStaticBlog/org-blog/"</span>)

(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-publish-title <span style="color: #2aa198;">"Hello, Org Static Blog"</span>)
(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-publish-url (format <span style="color: #2aa198;">"file://%s"</span> dms/org-static-blog-root-dir))
(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-publish-directory (format <span style="color: #2aa198;">"%s"</span> dms/org-static-blog-root-dir))
(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-posts-directory (format <span style="color: #2aa198;">"%sorg"</span> dms/org-static-blog-root-dir))
(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-drafts-directory (format <span style="color: #2aa198;">"%sdrafts"</span> dms/org-static-blog-root-dir))
(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-page-header (<span style="color: #859900; font-weight: bold;">with-temp-buffer</span>
  (insert-file-contents (format <span style="color: #2aa198;">"%sstatic/header.html"</span> dms/org-static-blog-root-dir))
  (buffer-string)))
(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-page-preamble (<span style="color: #859900; font-weight: bold;">with-temp-buffer</span>
  (insert-file-contents (format <span style="color: #2aa198;">"%sstatic/preamble.html"</span> dms/org-static-blog-root-dir))
  (buffer-string)))
(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-page-postamble (<span style="color: #859900; font-weight: bold;">with-temp-buffer</span>
  (insert-file-contents (format <span style="color: #2aa198;">"%sstatic/postamble.html"</span> dms/org-static-blog-root-dir))
  (buffer-string)))
(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-enable-tags t)
(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-use-preview t)
</pre>
</div>

<p>
Contents of <code>header.html</code>, <code>preamble.html</code> and <code>postamble.html</code> are given as follows.
Assets <code>static/style.css</code> and <code>static/favicon.ico</code> are downloaded from <a href="https://github.com/bastibe/bastibe.github.com/tree/master/static">Bastian</a>.
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #268bd2;">meta</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"author"</span> <span style="color: #268bd2;">content</span>=<span style="color: #2aa198;">"Dou Meishi"</span>&gt;
&lt;<span style="color: #268bd2;">meta</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"referrer"</span> <span style="color: #268bd2;">content</span>=<span style="color: #2aa198;">"no-referrer"</span>&gt;
&lt;<span style="color: #268bd2;">link</span> href= <span style="color: #2aa198;">"static/style.css"</span> <span style="color: #268bd2;">rel</span>=<span style="color: #2aa198;">"stylesheet"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"text/css"</span> /&gt;
&lt;<span style="color: #268bd2;">link</span> <span style="color: #268bd2;">href</span>=<span style="color: #2aa198;">"static/favicon.ico"</span> <span style="color: #268bd2;">rel</span>=<span style="color: #2aa198;">"icon"</span> /&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #268bd2;">div</span> <span style="color: #268bd2;">class</span>=<span style="color: #2aa198;">"header"</span>&gt;
  Hello, Org Static Blog
&lt;/<span style="color: #268bd2;">div</span>&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html">Created by &lt;<span style="color: #268bd2;">a</span> <span style="color: #268bd2;">href</span>=<span style="color: #2aa198;">"https://github.com/bastibe/org-static-blog/"</span>&gt;Org Static Blog&lt;/<span style="color: #268bd2;">a</span>&gt;
</pre>
</div>

<p>
Currently, the project layout looks like
</p>

<pre class="example" id="orga3f5248">
org-blog/
├── drafts
├── org
│   └── notes.org
└── static
    ├── favicon.ico
    ├── header.html
    ├── postamble.html
    ├── preamble.html
    └── style.css

3 directories, 6 files
</pre>

<p>
Finally, call  <code>org-static-blog-publish</code> to generate the site. At this time, the project layout becomes
</p>

<pre class="example" id="org23be5b2">
org-blog/
├── archive.html
├── drafts
├── index.html
├── notes.html
├── org
│   └── notes.org
├── rss.xml
├── static
│   ├── favicon.ico
│   ├── header.html
│   ├── postamble.html
│   ├── preamble.html
│   └── style.css
└── tags.html

3 directories, 11 files
</pre>
</div>
</div>

<div id="outline-container-org4e41046" class="outline-2">
<h2 id="org4e41046">Question</h2>
<div class="outline-text-2" id="text-org4e41046">
<ol class="org-ol">
<li><p>
Does it scans all org files in <code>org-static-blog-posts-directory</code> recursively or not?
</p>

<p>
Yes. For example, a folder named <code>2024/</code> in it will be published to the folder <code>2024/</code> in
<code>org-static-blog-publish-directory</code>.
</p></li>

<li><p>
Does it support following symbolic links when checking org files?
</p>

<p>
Yes but no. I test the following based on the project layout in the <i>Minimal Configuration</i> section.
I renamed the ordinary file <code>notes.org</code> inside <code>org-blog/org/</code> to <code>org-blog/../</code> but leave
a symbolic link. So the project layout becomes.
</p>

<pre class="example" id="org6dbeaf9">
org-blog/
├── drafts
├── org
│   └── notes.org -&gt; /home/dou/Documents/2024-01-22-TryOrgStaticBlog/notes.org
└── static
    ├── favicon.ico
    ├── header.html
    ├── postamble.html
    ├── preamble.html
    └── style.css

3 directories, 6 files
</pre>

<p>
However, calling <code>org-static-blog-pulish</code> exports <code>org-blog/org/notes.org</code> to <code>~/Documents/notes.html</code>.
</p>

<p>
This issue comes function <code>org-static-blog-get-post-public-path</code>. Running either
</p>

<div class="org-src-container">
<pre class="src src-elisp">(org-static-blog-get-post-public-path <span style="color: #2aa198;">"~/Documents/2024-01-22-TryOrgStaticBlog/notes.org"</span>)
</pre>
</div>

<p>
or
</p>

<div class="org-src-container">
<pre class="src src-elisp">(org-static-blog-get-post-public-path <span style="color: #2aa198;">"~/Documents/2024-01-22-TryOrgStaticBlog/org-blog/org/notes.org"</span>)
</pre>
</div>

<p>
gives the result <code>../../notes.html</code>.
</p></li>

<li><p>
What will happen if <code>org-static-blog-publish-directory</code> is the same
as <code>org-static-blog-posts-directory</code>?  In this case, what will happen
if <code>org-static-blog-drafts-directory</code> is a subfolder?
</p>

<p>
It behaves like exporting all org files to the same directory, and posts inside
the drafts directory will not be included in the index.
</p></li>
</ol>
</div>
</div>
