2024-01-22-TryOrgStaticBlog/notes.org
** Build My Blog Site

It is also not hard to extend the minimal configuration to build a
real blog site.  But before tweaking these scripts and assets, I need,
of course, get a public URL for hosting the site. Fortunately, GitHub
Pages allows hosting directly from a GitHub repository. What I need to
do is create a publich repo, say =org-blog=, and go to =Settings -> Pages=
and set the deploy target to =https://dou-meishi.github.io/blog/=.  Now
I can replace the previous local URL to this one in the script and
assets.

Besides changing the publish URL, there are a few other things to make
the site a slightly more visual appealing.

1. Add a top bar at each page, showing links to the homepage and the archive page.

   This can be easily done by modifying the =preamble.html=

   #+BEGIN_SRC html
<div class="header">
  <div class="sitelinks">
    <a href="https://dou-meishi.github.io/org-blog/index.html">Home</a>
    |
    <a href="https://dou-meishi.github.io/org-blog/archive.html">All Posts</a>
  </div>
</div>
   #+END_SRC

2. Render math formulae. This can also be achieved by adding appropriate javascript
   and stylesheets. Currently, I use [[https://katex.org/docs/browser][KaTeX]], which seems to be faster than MathJax.

   #+BEGIN_SRC html
<!-- Math Support by KaTeX -->
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/katex.min.css" integrity="sha384-n8MVd4RsNIU0tAv4ct0nTaAbDJwPJzDEaqSD1odI+WdtXRGWt2kTvGFasHpSy3SV" crossorigin="anonymous">
<!-- The loading of KaTeX is deferred to speed up page rendering -->
<script defer src="https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/katex.min.js" integrity="sha384-XjKyOOlGwcjNTAIQHIpgOno0Hl1YQqzUOEleOLALmuqehneUG+vnGctmUb0ZY0l8" crossorigin="anonymous"></script>
<!-- To automatically render math in text elements, include the auto-render extension: -->
<script defer src="https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/contrib/auto-render.min.js" integrity="sha384-+VBxd3r6XgURycqtZ117nYw44OOcIax56Z4dCRWbxyPt0Koah1uHoK0o4+/RRE05" crossorigin="anonymous" onload="renderMathInElement(document.body);"></script>
   #+END_SRC

3. Customize the top of the index page. This is done by setting the
   =org-static-blog-index-front-matter= variable in the lisp script.

   #+BEGIN_SRC elisp
(setq org-static-blog-index-front-matter
      "<h1 class=title> Recent Posts </h1>")
   #+END_SRC

4. Change the default ellipsis =(...)= used in preview to  =...=

   #+BEGIN_SRC elisp
(setq org-static-blog-preview-ellipsis "...")
   #+END_SRC

5. Use a different CSS stylesheet. I have been using [[http://gongzhitaao.org/orgcss][this stylesheet]]
   for three years and always appreciating its clean design. It is
   designed for HTML exported from org files by =org-publish=. To adapt
   it to files exported by =org-static-blog=, I create a patched CSS [[https://dou-meishi.github.io/orgcss/][here]].

   #+BEGIN_SRC html
<link href= "https://gongzhitaao.org/orgcss/org.css" rel="stylesheet" type="text/css" />
<link rel="stylesheet" type="text/css" href="https://dou-meishi.github.io/orgcss/dou-new-org.css"/>
   #+END_SRC

6. Sync posts from my document folder. As I mentioned in [[../2024-01-14-TryOrgPublish/notes.org][the previous post]], my notes resides in different event directories
   in the document folder, and, of course, I do not want to share the whole =~/Documents/= folder.
   So I list all files I want to share in =~/.unison/syncpost.prf=, which looks like

   #+BEGIN_SRC text
source default.prf

root = /home/dou/Documents
root = /home/dou/Documents/2024-01-24-MyOrgBlog/

nodeletion = /home/dou/Documents

path = 2023-09-19-Compactness/notes.org
path = 2023-10-23-BanachSpaceExample/notes.org
path = 2024-01-07-ReviewUnison/basics.org
path = 2024-01-07-ReviewUnison/advanced.org
path = 2024-01-11-CodeBlockinLaTeX/notes.org
path = 2024-01-11-CodeBlockinLaTeX/simple-code.png
path = 2024-01-11-CodeBlockinLaTeX/tcolorbox-listings.png
path = 2024-01-14-TryOrgPublish/notes.org
path = 2024-01-22-TryOrgStaticBlog/notes.org
   #+END_SRC

   Whenever I want to post something, I just check this file, run =unison-gui syncpost=,
   and execute all lisp script in the =build-blog.el=.

The lisp script and static assets are all included in [[https://github.com/Dou-Meishi/org-blog][my git repo]] for this blog.

** External Links                                                     :refs:

Below are other users' configuration on org static blog.

1. a simple setup: [[https://jao.io/blog/simplicity.html][simplicity - programming (and other) musings]]
2. another simple setup [[https://justin.abrah.ms/dotfiles/emacs.html#orgc787b23][Justin's emacs configuration - Writting - Blogging]]
3. an extensive setup: [[http://alhassy.com/AlBasmala#Why-not-use-an-existing-blogging-platform][AlBasmala: Blogging with Emacs & Org-mode (•̀ᴗ•́)و]]

