2024-01-22-TryOrgStaticBlog/notes.html

<div id="outline-container-org0ae630e" class="outline-2">
<h2 id="org0ae630e">Build My Blog Site</h2>
<div class="outline-text-2" id="text-org0ae630e">
<p>
It is also not hard to extend the minimal configuration to build a
real blog site.  But before tweaking these scripts and assets, I need,
of course, get a public URL for hosting the site. Fortunately, GitHub
Pages allows hosting directly from a GitHub repository. What I need to
do is create a publich repo, say <code>org-blog</code>, and go to <code>Settings -&gt; Pages</code>
and set the deploy target to <code>https://dou-meishi.github.io/blog/</code>.  Now
I can replace the previous local URL to this one in the script and
assets.
</p>

<p>
Besides changing the publish URL, there are a few other things to make
the site a slightly more visual appealing.
</p>

<ol class="org-ol">
<li><p>
Add a top bar at each page, showing links to the homepage and the archive page.
</p>

<p>
This can be easily done by modifying the <code>preamble.html</code>
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #268bd2;">div</span> <span style="color: #268bd2;">class</span>=<span style="color: #2aa198;">"header"</span>&gt;
  &lt;<span style="color: #268bd2;">div</span> <span style="color: #268bd2;">class</span>=<span style="color: #2aa198;">"sitelinks"</span>&gt;
    &lt;<span style="color: #268bd2;">a</span> <span style="color: #268bd2;">href</span>=<span style="color: #2aa198;">"https://dou-meishi.github.io/org-blog/index.html"</span>&gt;Home&lt;/<span style="color: #268bd2;">a</span>&gt;
    |
    &lt;<span style="color: #268bd2;">a</span> <span style="color: #268bd2;">href</span>=<span style="color: #2aa198;">"https://dou-meishi.github.io/org-blog/archive.html"</span>&gt;All Posts&lt;/<span style="color: #268bd2;">a</span>&gt;
  &lt;/<span style="color: #268bd2;">div</span>&gt;
&lt;/<span style="color: #268bd2;">div</span>&gt;
</pre>
</div></li>

<li><p>
Render math formulae. This can also be achieved by adding appropriate javascript
and stylesheets. Currently, I use <a href="https://katex.org/docs/browser">KaTeX</a>, which seems to be faster than MathJax.
</p>

<div class="org-src-container">
<pre class="src src-html"><span style="color: #93a1a1;">&lt;!-- </span><span style="color: #93a1a1;">Math Support by KaTeX</span><span style="color: #93a1a1;"> --&gt;</span>
&lt;<span style="color: #268bd2;">link</span> <span style="color: #268bd2;">rel</span>=<span style="color: #2aa198;">"stylesheet"</span> <span style="color: #268bd2;">href</span>=<span style="color: #2aa198;">"https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/katex.min.css"</span> <span style="color: #268bd2;">integrity</span>=<span style="color: #2aa198;">"sha384-n8MVd4RsNIU0tAv4ct0nTaAbDJwPJzDEaqSD1odI+WdtXRGWt2kTvGFasHpSy3SV"</span> <span style="color: #268bd2;">crossorigin</span>=<span style="color: #2aa198;">"anonymous"</span>&gt;
<span style="color: #93a1a1;">&lt;!-- </span><span style="color: #93a1a1;">The loading of KaTeX is deferred to speed up page rendering</span><span style="color: #93a1a1;"> --&gt;</span>
&lt;<span style="color: #268bd2;">script</span> defer <span style="color: #268bd2;">src</span>=<span style="color: #2aa198;">"https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/katex.min.js"</span> <span style="color: #268bd2;">integrity</span>=<span style="color: #2aa198;">"sha384-XjKyOOlGwcjNTAIQHIpgOno0Hl1YQqzUOEleOLALmuqehneUG+vnGctmUb0ZY0l8"</span> <span style="color: #268bd2;">crossorigin</span>=<span style="color: #2aa198;">"anonymous"</span>&gt;&lt;/<span style="color: #268bd2;">script</span>&gt;
<span style="color: #93a1a1;">&lt;!-- </span><span style="color: #93a1a1;">To automatically render math in text elements, include the auto-render extension:</span><span style="color: #93a1a1;"> --&gt;</span>
&lt;<span style="color: #268bd2;">script</span> defer <span style="color: #268bd2;">src</span>=<span style="color: #2aa198;">"https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/contrib/auto-render.min.js"</span> <span style="color: #268bd2;">integrity</span>=<span style="color: #2aa198;">"sha384-+VBxd3r6XgURycqtZ117nYw44OOcIax56Z4dCRWbxyPt0Koah1uHoK0o4+/RRE05"</span> <span style="color: #268bd2;">crossorigin</span>=<span style="color: #2aa198;">"anonymous"</span> <span style="color: #268bd2;">onload</span>=<span style="color: #2aa198;">"renderMathInElement(document.body);"</span>&gt;&lt;/<span style="color: #268bd2;">script</span>&gt;
</pre>
</div></li>

<li><p>
Customize the top of the index page. This is done by setting the
<code>org-static-blog-index-front-matter</code> variable in the lisp script.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-index-front-matter
      <span style="color: #2aa198;">"&lt;h1 class=title&gt; Recent Posts &lt;/h1&gt;"</span>)
</pre>
</div></li>

<li><p>
Change the default ellipsis <code>(...)</code> used in preview to  <code>...</code>
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #859900; font-weight: bold;">setq</span> org-static-blog-preview-ellipsis <span style="color: #2aa198;">"..."</span>)
</pre>
</div></li>

<li><p>
Use a different CSS stylesheet. I have been using <a href="http://gongzhitaao.org/orgcss">this stylesheet</a>
for three years and always appreciating its clean design. It is
designed for HTML exported from org files by <code>org-publish</code>. To adapt
it to files exported by <code>org-static-blog</code>, I add several additional
rules in <a href="https://dou-meishi.github.io/org-blog/static/dou-org-blog.css">a patched CSS</a>.
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #268bd2;">link</span> href= <span style="color: #2aa198;">"https://gongzhitaao.org/orgcss/org.css"</span> <span style="color: #268bd2;">rel</span>=<span style="color: #2aa198;">"stylesheet"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"text/css"</span> /&gt;
&lt;<span style="color: #268bd2;">link</span> href= <span style="color: #2aa198;">"https://dou-meishi.github.io/org-blog/static/dou-org-blog.css"</span> <span style="color: #268bd2;">rel</span>=<span style="color: #2aa198;">"stylesheet"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"text/css"</span> /&gt;
</pre>
</div></li>

<li><p>
Sync posts from my document folder. As I mentioned in <a href="../2024-01-14-TryOrgPublish/notes.html">the previous post</a>, my notes resides in different event directories
in the document folder, and, of course, I do not want to share the whole <code>~/Documents/</code> folder.
So I list all files I want to share in <code>~/.unison/syncpost.prf</code>, which looks like
</p>

<div class="org-src-container">
<pre class="src src-text">source default.prf

root = /home/dou/Documents
root = /home/dou/Documents/2024-01-24-MyOrgBlog/

nodeletion = /home/dou/Documents

path = 2023-09-19-Compactness/notes.org
path = 2023-10-23-BanachSpaceExample/notes.org
path = 2024-01-07-ReviewUnison/basics.org
path = 2024-01-07-ReviewUnison/advanced.org
path = 2024-01-11-CodeBlockinLaTeX/notes.org
path = 2024-01-11-CodeBlockinLaTeX/simple-code.png
path = 2024-01-11-CodeBlockinLaTeX/tcolorbox-listings.png
path = 2024-01-14-TryOrgPublish/notes.org
path = 2024-01-22-TryOrgStaticBlog/notes.org
</pre>
</div>

<p>
Whenever I want to post something, I just check this file, run <code>unison-gui syncpost</code>,
and execute all lisp script in the <code>build-blog.el</code>.
</p></li>
</ol>

<p>
The lisp script and static assets are all included in <a href="https://github.com/Dou-Meishi/org-blog">my git repo</a> for this blog.
</p>
</div>
</div>

<div id="outline-container-org5f867cc" class="outline-2">
<h2 id="org5f867cc">External Links&#xa0;&#xa0;&#xa0;<span class="tag"><span class="refs">refs</span></span></h2>
<div class="outline-text-2" id="text-org5f867cc">
<p>
Below are other users' configuration on org static blog.
</p>

<ol class="org-ol">
<li>a simple setup: <a href="https://jao.io/blog/simplicity.html">simplicity - programming (and other) musings</a></li>
<li>another simple setup <a href="https://justin.abrah.ms/dotfiles/emacs.html#orgc787b23">Justin's emacs configuration - Writting - Blogging</a></li>
<li>an extensive setup: <a href="http://alhassy.com/AlBasmala#Why-not-use-an-existing-blogging-platform">AlBasmala: Blogging with Emacs &amp; Org-mode (•̀ᴗ•́)و</a></li>
</ol>
</div>
</div>
<div class="taglist"><a href="https://dou-meishi.github.io/org-blog/tags.html">Tags</a>: <a href="https://dou-meishi.github.io/org-blog/tag-emacs.html">emacs</a> </div></div>
<div id="postamble" class="status">Created by <a href="https://github.com/bastibe/org-static-blog/">Org Static Blog</a>
</div>
</body>
</html>
